IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI2_MCSPI2.xml
	<register id="MCSPI2_IRQENABLE" acronym="MCSPI2_IRQENABLE" offset="0x11C" width="32" description="">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads return 0" range="31 - 18" rwaccess="RO"/> 
		<bitfield id="EOW_ENABLE" width="1" begin="17" end="17" resetval="0x0" description="End of Word count Interrupt Enable" range="17" rwaccess="RW"/> 
		<bitfield id="WKE" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event interrupt Enable in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="16" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="RO"/> 
		<bitfield id="RX3_FULL_ENABLE" width="1" begin="14" end="14" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 3" range="14" rwaccess="RW"/> 
		<bitfield id="TX3_UNDERFLOW_ENABLE" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 3" range="13" rwaccess="RW"/> 
		<bitfield id="TX3_EMPTY_ENABLE" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch3" range="12" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads return 0" range="11" rwaccess="RO"/> 
		<bitfield id="RX2_FULL_ENABLE" width="1" begin="10" end="10" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 2" range="10" rwaccess="RW"/> 
		<bitfield id="TX2_UNDERFLOW_ENABLE" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 2" range="9" rwaccess="RW"/> 
		<bitfield id="TX2_EMPTY_ENABLE" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 2" range="8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads return 0" range="7" rwaccess="RO"/> 
		<bitfield id="RX1_FULL_ENABLE" width="1" begin="6" end="6" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 1" range="6" rwaccess="RW"/> 
		<bitfield id="TX1_UNDERFLOW_ENABLE" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 1" range="5" rwaccess="RW"/> 
		<bitfield id="TX1_EMPTY_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 1" range="4" rwaccess="RW"/> 
		<bitfield id="RX0_OVERFLOW_ENABLE" width="1" begin="3" end="3" resetval="0x0" description="Receiver register Overflow Interrupt Enable Ch 0" range="3" rwaccess="RW"/> 
		<bitfield id="RX0_FULL_ENABLE" width="1" begin="2" end="2" resetval="0x0" description="Receiver register Full Interrupt Enable Ch 0" range="2" rwaccess="RW"/> 
		<bitfield id="TX0_UNDERFLOW_ENABLE" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register Underflow Interrupt Enable Ch 0" range="1" rwaccess="RW"/> 
		<bitfield id="TX0_EMPTY_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register Empty Interrupt Enable Ch 0" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_WAKEUPENABLE" acronym="MCSPI2_WAKEUPENABLE" offset="0x120" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reads returns 0" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="WKEN" width="1" begin="0" end="0" resetval="0x0" description="WakeUp functionality in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_SYST" acronym="MCSPI2_SYST" offset="0x124" width="32" description="">
		<bitfield id="RESERVED" width="20" begin="31" end="12" resetval="0x0" description="Reads returns 0" range="31 - 12" rwaccess="RO"/> 
		<bitfield id="SSB" width="1" begin="11" end="11" resetval="0x0" description="Set status bit" range="11" rwaccess="RW"/> 
		<bitfield id="SPIENDIR" width="1" begin="10" end="10" resetval="0x0" description="Set the direction of the SPIEN[3:0] lines and SPICLK line" range="10" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR1" width="1" begin="9" end="9" resetval="0x0" description="Set the direction of the SPIDAT[1]" range="9" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR0" width="1" begin="8" end="8" resetval="0x0" description="Set the direction of the SPIDAT[0]" range="8" rwaccess="RW"/> 
		<bitfield id="WAKD" width="1" begin="7" end="7" resetval="0x0" description="SWAKEUP output [signal data value of internal signal to system] The signal is driven high or low according to the value written into this register bit" range="7" rwaccess="RW"/> 
		<bitfield id="SPICLK" width="1" begin="6" end="6" resetval="0x0" description="SPICLK line [signal data value] If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the CLKSPI line [high or low], and a write into this bit has no effect If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the CLKSPI line is driven high or low according to the value written into this register" range="6" rwaccess="RW"/> 
		<bitfield id="SPIDAT_1" width="1" begin="5" end="5" resetval="0x0" description="SPIDAT[1] line [signal data value] If MCSPI_SYST[SPIDATDIR1] = 0 [output mode direction], the SPIDAT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR1] = 1 [input mode direction], this bit returns the value on the SPIDAT[1] line [high or low], and a write into this bit has no effect" range="5" rwaccess="RW"/> 
		<bitfield id="SPIDAT_0" width="1" begin="4" end="4" resetval="0x0" description="SPIDAT[0] line [signal data value] If MCSPI_SYST[SPIDATDIR0] = 0 [output mode direction], the SPIDAT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR0] = 1 [input mode direction], this bit returns the value on the SPIDAT[0] line [high or low], and a write into this bit has no effect" range="4" rwaccess="RW"/> 
		<bitfield id="SPIEN_3" width="1" begin="3" end="3" resetval="0x0" description="SPIEN[3] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[3] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[3] line [high or low], and a write into this bit has no effect" range="3" rwaccess="RW"/> 
		<bitfield id="SPIEN_2" width="1" begin="2" end="2" resetval="0x0" description="SPIEN[2] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[2] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[2] line [high or low], and a write into this bit has no effect" range="2" rwaccess="RW"/> 
		<bitfield id="SPIEN_1" width="1" begin="1" end="1" resetval="0x0" description="SPIEN[1] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[1] line [high or low], and a write into this bit has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="SPIEN_0" width="1" begin="0" end="0" resetval="0x0" description="SPIEN[0] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[0] line [high or low], and a write into this bit has no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_MODULCTRL" acronym="MCSPI2_MODULCTRL" offset="0x128" width="32" description="">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="Reads returns 0" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="FDAA" width="1" begin="8" end="8" resetval="0x0" description="FIFO DMA Address 256-bit aligned This register is used when a FIFO is managed by the module and DMA connected to the controller provides only 256 bit aligned address If this bit is set the enabled channel which uses the FIFO has its datas managed through MCSPI_DAFTX and MCSPI_DAFRX registers instead of MCSPI_TX[i] and MCSPI_RX[i] registers" range="8" rwaccess="RW"/> 
		<bitfield id="MOA" width="1" begin="7" end="7" resetval="0x0" description="Multiple word ocp access: This register can only be used when a channel is enabled using a FIFO It allows the system to perform multiple SPI word access for a single 32-bit OCP word access This is possible for WL &#60; 16" range="7" rwaccess="RW"/> 
		<bitfield id="INITDLY" width="3" begin="6" end="4" resetval="0x0" description="Initial spi delay for first transfer: This register is an option only available in SINGLE master mode, The controller waits for a delay to transmit the first spi word after channel enabled and corresponding TX register filled This Delay is based on SPI output frequency clock, No clock output provided to the boundary and chip select is not active in 4 pin mode within this period" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="SYSTEM_TEST" width="1" begin="3" end="3" resetval="0x0" description="Enables the system test mode" range="3" rwaccess="RW"/> 
		<bitfield id="MS" width="1" begin="2" end="2" resetval="0x1" description="Master/ Slave" range="2" rwaccess="RW"/> 
		<bitfield id="PIN34" width="1" begin="1" end="1" resetval="0x0" description="Pin mode selection: This register is used to configure the SPI pin mode, in master or slave mode If asserted the controller only use SIMO,SOMI and SPICLK clock pin for spi transfers" range="1" rwaccess="RW"/> 
		<bitfield id="SINGLE" width="1" begin="0" end="0" resetval="0x0" description="Single channel / Multi Channel [master mode only]" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_CH0CONF" acronym="MCSPI2_CH0CONF" offset="0x12C" width="32" description="">
		<bitfield id="RESERVED" width="2" begin="31" end="30" resetval="0x0" description="read returns 0" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="CLKG" width="1" begin="29" end="29" resetval="0x0" description="Clock divider granularity This register defines the granularity of channel clock divider: power of two or one clock cycle granularity When this bit is set the register MCSPI_CHCTRL[EXTCLK] must be configured to reach a maximum of 4096 clock divider ratio Then The clock divider ratio is a concatenation of MCSPI_CHCONF[CLKD] and MCSPI_CHCTRL[EXTCLK] values" range="29" rwaccess="RW"/> 
		<bitfield id="FFER" width="1" begin="28" end="28" resetval="0x0" description="FIFO enabled for receive:Only one channel can have this bit field set" range="28" rwaccess="RW"/> 
		<bitfield id="FFEW" width="1" begin="27" end="27" resetval="0x0" description="FIFO enabled for Transmit:Only one channel can have this bit field set" range="27" rwaccess="RW"/> 
		<bitfield id="TCS0" width="2" begin="26" end="25" resetval="0x0" description="Chip Select Time Control This 2-bits field defines the number of interface clock cycles between CS toggling and first or last edge of SPI clock" range="26 - 25" rwaccess="RW"/> 
		<bitfield id="SBPOL" width="1" begin="24" end="24" resetval="0x0" description="Start bit polarity" range="24" rwaccess="RW"/> 
		<bitfield id="SBE" width="1" begin="23" end="23" resetval="0x0" description="Start bit enable for SPI transfer" range="23" rwaccess="RW"/> 
		<bitfield id="SPIENSLV" width="2" begin="22" end="21" resetval="0x0" description="Channel 0 only and slave mode only: SPI slave select signal detection Reserved bits for other cases" range="22 - 21" rwaccess="RW"/> 
		<bitfield id="FORCE" width="1" begin="20" end="20" resetval="0x0" description="Manual SPIEN assertion to keep SPIEN active between SPI words [single channel master mode only]" range="20" rwaccess="RW"/> 
		<bitfield id="TURBO" width="1" begin="19" end="19" resetval="0x0" description="Turbo mode" range="19" rwaccess="RW"/> 
		<bitfield id="IS" width="1" begin="18" end="18" resetval="0x1" description="Input Select" range="18" rwaccess="RW"/> 
		<bitfield id="DPE1" width="1" begin="17" end="17" resetval="0x1" description="Transmission Enable for data line 1 [SPIDATAGZEN[1]]" range="17" rwaccess="RW"/> 
		<bitfield id="DPE0" width="1" begin="16" end="16" resetval="0x0" description="Transmission Enable for data line 0 [SPIDATAGZEN[0]]" range="16" rwaccess="RW"/> 
		<bitfield id="DMAR" width="1" begin="15" end="15" resetval="0x0" description="DMA Read request The DMA Read request line is asserted when the channel is enabled and a new data is available in the receive register of the channel The DMA Read request line is deasserted on read completion of the receive register of the channel" range="15" rwaccess="RW"/> 
		<bitfield id="DMAW" width="1" begin="14" end="14" resetval="0x0" description="DMA Write request The DMA Write request line is asserted when The channel is enabled and the transmitter register of the channel is empty The DMA Write request line is deasserted on load completion of the transmitter register of the channel" range="14" rwaccess="RW"/> 
		<bitfield id="TRM" width="2" begin="13" end="12" resetval="0x0" description="Transmit/Receive modes" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="WL" width="5" begin="11" end="7" resetval="0x0" description="SPI word length" range="11 - 7" rwaccess="RW"/> 
		<bitfield id="EPOL" width="1" begin="6" end="6" resetval="0x0" description="SPIEN polarity" range="6" rwaccess="RW"/> 
		<bitfield id="CLKD" width="4" begin="5" end="2" resetval="0x0" description="Frequency divider for SPICLK [only when the module is a Master SPI device] A programmable clock divider divides the SPI reference clock [CLKSPIREF] with a 4-bit value, and results in a new clock SPICLK available to shift-in and shift-out data By default the clock divider ratio has a power of two granularity when MCSPI_CHCONF[CLKG] is cleared, Otherwise this register is the 4 LSB bit of a 12-bit register concatenated with clock divider extension MCSPI_CHCTRL[EXTCLK] registerThe value description below defines the clock ratio when MCSPI_CHCONF[CLKG] is set to 0" range="5 - 2" rwaccess="RW"/> 
		<bitfield id="POL" width="1" begin="1" end="1" resetval="0x0" description="SPICLK polarity" range="1" rwaccess="RW"/> 
		<bitfield id="PHA" width="1" begin="0" end="0" resetval="0x0" description="SPICLK phase" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_CH0STAT" acronym="MCSPI2_CH0STAT" offset="0x130" width="32" description="">
		<bitfield id="RESERVED" width="25" begin="31" end="7" resetval="0x0" description="Read returns 0" range="31 - 7" rwaccess="RO"/> 
		<bitfield id="RXFFF" width="1" begin="6" end="6" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Full Status" range="6" rwaccess="RO"/> 
		<bitfield id="RXFFE" width="1" begin="5" end="5" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Empty Status" range="5" rwaccess="RO"/> 
		<bitfield id="TXFFF" width="1" begin="4" end="4" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Full Status" range="4" rwaccess="RO"/> 
		<bitfield id="TXFFE" width="1" begin="3" end="3" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Empty Status" range="3" rwaccess="RO"/> 
		<bitfield id="EOT" width="1" begin="2" end="2" resetval="0x0" description="Channel 'i' End of transfer Status The definitions of beginning and end of transfer vary with master versus slave and the transfer format [Transmit/Receive modes, Turbo mode] See dedicated chapters for details" range="2" rwaccess="RO"/> 
		<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 'i' Transmitter Register Status" range="1" rwaccess="RO"/> 
		<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 'i' Receiver Register Status" range="0" rwaccess="RO"/>
	</register>
