IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI2_MCSPI2.xml
	<register id="MCSPI2_CH3STAT" acronym="MCSPI2_CH3STAT" offset="0x16C" width="32" description="">
		<bitfield id="RESERVED" width="25" begin="31" end="7" resetval="0x0" description="Read returns 0" range="31 - 7" rwaccess="RO"/> 
		<bitfield id="RXFFF" width="1" begin="6" end="6" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Full Status" range="6" rwaccess="RO"/> 
		<bitfield id="RXFFE" width="1" begin="5" end="5" resetval="0x0" description="Channel 'i' FIFO Receive Buffer Empty Status" range="5" rwaccess="RO"/> 
		<bitfield id="TXFFF" width="1" begin="4" end="4" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Full Status" range="4" rwaccess="RO"/> 
		<bitfield id="TXFFE" width="1" begin="3" end="3" resetval="0x0" description="Channel 'i' FIFO Transmit Buffer Empty Status" range="3" rwaccess="RO"/> 
		<bitfield id="EOT" width="1" begin="2" end="2" resetval="0x0" description="Channel 'i' End of transfer Status The definitions of beginning and end of transfer vary with master versus slave and the transfer format [Transmit/Receive modes, Turbo mode] See dedicated chapters for details" range="2" rwaccess="RO"/> 
		<bitfield id="TXS" width="1" begin="1" end="1" resetval="0x0" description="Channel 'i' Transmitter Register Status" range="1" rwaccess="RO"/> 
		<bitfield id="RXS" width="1" begin="0" end="0" resetval="0x0" description="Channel 'i' Receiver Register Status" range="0" rwaccess="RO"/>
	</register>
	<register id="MCSPI2_CH3CTRL" acronym="MCSPI2_CH3CTRL" offset="0x170" width="32" description="">
		<bitfield id="RESERVED" width="16" begin="31" end="16" resetval="0x0" description="Read returns 0" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="EXTCLK" width="8" begin="15" end="8" resetval="0x0" description="Clock ratio extension: This register is used to concatenate with MCSPI_CHCONF[CLKD] register for clock ratio only when granularity is one clock cycle [MCSPI_CHCONF[CLKG] set to 1] Then the max value reached is 4096 clock divider ratio" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="Read returns 0" range="7 - 1" rwaccess="RO"/> 
		<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Channel Enable" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_TX3" acronym="MCSPI2_TX3" offset="0x174" width="32" description="">
		<bitfield id="TDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Data to transmit" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_RX3" acronym="MCSPI2_RX3" offset="0x178" width="32" description="">
		<bitfield id="RDATA" width="32" begin="31" end="0" resetval="0x0" description="Channel 3 Received Data" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MCSPI2_XFERLEVEL" acronym="MCSPI2_XFERLEVEL" offset="0x17C" width="32" description="">
		<bitfield id="WCNT" width="16" begin="31" end="16" resetval="0x0" description="Spi word counterThis register holds the programmable value of number of SPI word to be transferred on channel which is using the FIFO bufferWhen transfer had started, a read back in this register returns the current SPI word transfer index" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="AFL" width="8" begin="15" end="8" resetval="0x0" description="Buffer Almost Full This register holds the programmable almost full level value used to determine almost full buffer condition If the user wants an interrupt or a DMA read request to be issued during a receive operation when the data buffer holds at least n bytes, then the buffer MCSPI_MODULCTRL[AFL] must be set with n-1The size of this register is defined by the generic parameter FFNBYTE" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="AEL" width="8" begin="7" end="0" resetval="0x0" description="Buffer Almost EmptyThis register holds the programmable almost empty level value used to determine almost empty buffer condition If the user wants an interrupt or a DMA write request to be issued during a transmit operation when the data buffer is able to receive n bytes, then the buffer MCSPI_MODULCTRL[AEL] must be set with n-1" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_DAFTX" acronym="MCSPI2_DAFTX" offset="0x180" width="32" description="">
		<bitfield id="DAFTDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MCSPI2_DAFRX" acronym="MCSPI2_DAFRX" offset="0x1A0" width="32" description="">
		<bitfield id="DAFRDATA" width="32" begin="31" end="0" resetval="0x0" description="FIFO Data to transmit with DMA 256 bit aligned address This Register is only is used when MCSPI_MODULCTRL[FDAA] is set to '1' and only one of the MCSPI_CH[i]CONF[FFEW] of enabled channels is set If these conditions are not respected any access to this register return a null value" range="31 - 0" rwaccess="RO"/>
	</register>
</module>